app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("blurb", "created_at", "picture", "recipe", "submitter", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["blurb", "asdf"], ["created_at", Wed, 31 Jul 2013 02:23:36 UTC +00:00], ["picture", "asdf"], ["recipe", "asdf"], ["submitter", "asdf"], ["updated_at", Wed, 31 Jul 2013 02:23:36 UTC +00:00]]